; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	infrared1 - mode
	spectrograph2 - mode
	infrared0 - mode
	GroundStation0 - direction
	Star1 - direction
	Star2 - direction
	Phenomenon3 - direction
	Planet4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Planet14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star2)
	(supports instrument1 infrared0)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
	(supports instrument3 infrared1)
	(supports instrument3 spectrograph2)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(supports instrument4 infrared0)
	(supports instrument4 spectrograph2)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon3)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star2)
	(supports instrument6 infrared0)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 GroundStation0)
	(supports instrument7 infrared1)
	(supports instrument7 infrared0)
	(calibration_target instrument7 Star2)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon8)
	(supports instrument8 infrared1)
	(calibration_target instrument8 Star1)
	(supports instrument9 infrared1)
	(supports instrument9 spectrograph2)
	(calibration_target instrument9 Star1)
	(supports instrument10 infrared0)
	(supports instrument10 spectrograph2)
	(calibration_target instrument10 Star2)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star2)
)
(:goal (and
	(pointing satellite1 GroundStation0)
	(pointing satellite3 Star15)
	(have_image Phenomenon3 infrared1)
	(have_image Planet4 infrared1)
	(have_image Phenomenon5 spectrograph2)
	(have_image Star6 spectrograph2)
	(have_image Phenomenon7 infrared0)
	(have_image Phenomenon8 infrared0)
	(have_image Phenomenon9 infrared1)
	(have_image Planet10 infrared1)
	(have_image Planet14 infrared1)
	(have_image Star15 infrared0)
	(have_image Phenomenon16 spectrograph2)
	(have_image Phenomenon17 infrared0)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 1 of 14
2. (calibrate satellite4 instrument10 star2)
   added: (calibrated instrument10)
   goals met: 1 of 14
3. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 14
4. (calibrate satellite1 instrument3 groundstation0)
   added: (calibrated instrument3)
   goals met: 1 of 14
5. (turn_to satellite4 phenomenon16 star2)
   deleted: (pointing satellite4 star2)
   added: (pointing satellite4 phenomenon16)
   goals met: 1 of 14
6. (take_image satellite4 phenomenon16 instrument10 spectrograph2)
   added: (have_image phenomenon16 spectrograph2)
   goals met: 2 of 14
7. (turn_to satellite4 phenomenon17 phenomenon16)
   deleted: (pointing satellite4 phenomenon16)
   added: (pointing satellite4 phenomenon17)
   goals met: 2 of 14
8. (take_image satellite4 phenomenon17 instrument10 infrared0)
   added: (have_image phenomenon17 infrared0)
   goals met: 3 of 14
9. (turn_to satellite4 phenomenon5 phenomenon17)
   deleted: (pointing satellite4 phenomenon17)
   added: (pointing satellite4 phenomenon5)
   goals met: 3 of 14
10. (take_image satellite4 phenomenon5 instrument10 spectrograph2)
   added: (have_image phenomenon5 spectrograph2)
   goals met: 4 of 14
11. (turn_to satellite4 phenomenon7 phenomenon5)
   deleted: (pointing satellite4 phenomenon5)
   added: (pointing satellite4 phenomenon7)
   goals met: 4 of 14
12. (take_image satellite4 phenomenon7 instrument10 infrared0)
   added: (have_image phenomenon7 infrared0)
   goals met: 5 of 14
13. (turn_to satellite4 phenomenon8 phenomenon7)
   deleted: (pointing satellite4 phenomenon7)
   added: (pointing satellite4 phenomenon8)
   goals met: 5 of 14
14. (take_image satellite4 phenomenon8 instrument10 infrared0)
   added: (have_image phenomenon8 infrared0)
   goals met: 6 of 14
15. (turn_to satellite4 star15 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 star15)
   goals met: 6 of 14
16. (take_image satellite4 star15 instrument10 infrared0)
   added: (have_image star15 infrared0)
   goals met: 7 of 14
17. (turn_to satellite4 star6 star15)
   deleted: (pointing satellite4 star15)
   added: (pointing satellite4 star6)
   goals met: 7 of 14
18. (take_image satellite4 star6 instrument10 spectrograph2)
   added: (have_image star6 spectrograph2)
   goals met: 8 of 14
19. (turn_to satellite3 star15 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 star15)
   goals met: 9 of 14
20. (turn_to satellite1 phenomenon3 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon3)
   goals met: 8 of 14
21. (take_image satellite1 phenomenon3 instrument3 infrared1)
   added: (have_image phenomenon3 infrared1)
   goals met: 9 of 14
22. (turn_to satellite1 groundstation0 phenomenon3)
   deleted: (pointing satellite1 phenomenon3)
   added: (pointing satellite1 groundstation0)
   goals met: 10 of 14
23. (turn_to satellite1 phenomenon9 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon9)
   goals met: 9 of 14
24. (take_image satellite1 phenomenon9 instrument3 infrared1)
   added: (have_image phenomenon9 infrared1)
   goals met: 10 of 14
25. (turn_to satellite1 groundstation0 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 groundstation0)
   goals met: 11 of 14
26. (turn_to satellite1 planet10 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet10)
   goals met: 10 of 14
27. (take_image satellite1 planet10 instrument3 infrared1)
   added: (have_image planet10 infrared1)
   goals met: 11 of 14
28. (turn_to satellite1 groundstation0 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 groundstation0)
   goals met: 12 of 14
29. (turn_to satellite1 planet14 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet14)
   goals met: 11 of 14
30. (take_image satellite1 planet14 instrument3 infrared1)
   added: (have_image planet14 infrared1)
   goals met: 12 of 14
31. (turn_to satellite1 groundstation0 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 groundstation0)
   goals met: 13 of 14
32. (turn_to satellite1 planet4 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet4)
   goals met: 12 of 14
33. (take_image satellite1 planet4 instrument3 infrared1)
   added: (have_image planet4 infrared1)
   goals met: 13 of 14
34. (turn_to satellite1 groundstation0 planet4)
   deleted: (pointing satellite1 planet4)
   added: (pointing satellite1 groundstation0)
   goals met: 14 of 14
